miniproject/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)

    (0.45 1 0)
    (0.55 1 0)
    (0.45 1 0.1)
    (0.55 1 0.1)

    (0.4 0 0)
    (0.6 0 0)
    (0.4 0 0.1)
    (0.6 0 0.1)

);

blocks
(
    hex (0 12 8 3 4 14 10 7) (20 20 1) simpleGrading (1 1 1)
    hex (12 13 9 8 14 15 11 10) (20 20 1) simpleGrading (1 1 1)
    hex (13 1 2 9 15 5 6 11) (20 20 1) simpleGrading (1 1 1)
    // hex (0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15) (20 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (12 13 15 14)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 11 10)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 3 7 4)
            (1 2 6 5)
            (3 8 10 7)
            (11 6 2 9)
            (0 12 14 4)
            (15 5 1 13)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 12 8 3)
            (12 13 9 8)
            (13 1 2 9)

            (4 14 10 7)
            (14 15 11 10)
            (15 5 6 11)
        );
    }
);


// ************************************************************************* //
