miniproject/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType      RAS;

RAS
{
    RASModel                kOmegaSST;

    // On/off switch
    turbulence              on;

    // Optionally write the model coefficients at run-time
    printCoeffs             no;

    // Optionally override default model coefficients
}